results/results_c5_large/results_c5_large_run1/oltp_read_only_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 158.17 qps: 2534.77 (r/w/o: 2218.03/0.00/316.75) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 125.40 qps: 2006.04 (r/w/o: 1755.24/0.00/250.81) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 164.00 qps: 2624.70 (r/w/o: 2296.70/0.00/328.00) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 162.30 qps: 2595.59 (r/w/o: 2270.99/0.00/324.60) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 162.00 qps: 2592.00 (r/w/o: 2268.00/0.00/324.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 163.80 qps: 2621.10 (r/w/o: 2293.50/0.00/327.60) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 160.80 qps: 2571.91 (r/w/o: 2250.31/0.00/321.60) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 143.50 qps: 2297.30 (r/w/o: 2010.30/0.00/287.00) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 157.50 qps: 2520.20 (r/w/o: 2205.20/0.00/315.00) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 162.90 qps: 2606.70 (r/w/o: 2280.90/0.00/325.80) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 157.50 qps: 2517.09 (r/w/o: 2202.19/0.00/314.90) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 161.10 qps: 2580.01 (r/w/o: 2257.71/0.00/322.30) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            263116
        write:                           0
        other:                           37588
        total:                           300704
    transactions:                        18794  (156.59 per sec.)
    queries:                             300704 (2505.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      156.5885
    time elapsed:                        120.0216s
    total number of events:              18794

Latency (ms):
         min:                                   11.61
         avg:                                   25.54
         max:                                  166.14
         95th percentile:                       46.63
         sum:                               480021.39

Threads fairness:
    events (avg/stddev):           4698.5000/38.63
    execution time (avg/stddev):   120.0053/0.01